Repository: MuchaSsak/expo-i18n-auth-boilerplate
Catalog: src/locales/*/messages.po
Languages: pl

source: Select theme
pl: Wybierz motyw

source: Select language
pl: Wybierz język

source: Home
pl: Strona główna

source: <0>Already have an account? </0><1><2>Log in</2></1>
pl: <0>Już posiadasz konto? </0><1><2>Zaloguj się</2></1>

source: <0>Button from</0><1>React Native Reusables!</1>
pl: <0>Przycisk od</0><1>React Native Reusables!</1>

source: <0>Don't have an account? </0><1><2>Register now</2></1>
pl: <0>Nie posiadasz konta? </0><1><2>Zarejestruj się</2></1>

source: Back to / page
pl: Powróć do podstrony /

source: Check inbox
pl: Sprawdź pocztę

source: Confirm password
pl: Potwierdź hasło

source: Confirm password is required
pl: Potwierdzenie hasła jest wymagane

source: Confirm your email
pl: Potwierdź swój email

source: Continue
pl: Kontynuuj

source: Couldn't create the account!
pl: Tworzenie konta nie powiodło się!

source: Couldn't log out!
pl: Wylogowywanie nie powiodło się!

source: Couldn't resend the mail!
pl: Ponowne wysłanie maila nie powiodło się!

source: Couldn't reset the password!
pl: Zresetowanie hasła nie powiodło się!

source: Couldn't sign in!
pl: Logowanie nie powiodło się!

source: Couldn't update the password!
pl: Zaaktualizaowanie hasła nie powiodło się!

source: Create your account
pl: Utwórz konto

source: Dark
pl: Ciemny

source: English
pl: Angielski

source: Enter a new password in order to change it
pl: Wprowadź nowe hasło aby je zmienić

source: Enter your email to reset your password
pl: Wprowadź swój email aby zresetować hasło

source: Forgot password?
pl: Zapomniałeś hasła?

source: Forgot your password?
pl: Zapomniałeś hasła?

source: Go to the /confirm-email/john.doe@example.com page
pl: Przejdź do podstrony /confirm-email/john.doe@example.com

source: Go to the /login page
pl: Przejdź do podstrony /login

source: Go to the /register page
pl: Przejdź do podstrony /register

source: Go to the /reset-password page
pl: Przejdź do podstrony /reset-password

source: Go to the /update-password page
pl: Przejdź do podstrony /update-password

source: Google Play Services are currently not available
pl: Serwisy Google Play są aktualnie nie dostępne

source: John
pl: Jan

source: john.doe@example.com
pl: jan.kowalski@przyklad.com

source: Light
pl: Jasny

source: Log in to your app
pl: Zaloguj się do twojej aplikacji

source: Log in via Google
pl: Zaloguj się za pomocą Google

source: Log out
pl: Wyloguj się

source: Logged in successfully!
pl: Zalogowano pomyślnie!

source: Logged out successfully!
pl: Wylogowano pomyślnie!

source: Logging in was cancelled
pl: Logowanie zostało anulowane

source: Logging in was interrupted
pl: Logowanie zostało przerwane

source: Name
pl: Imię

source: Name is required
pl: Imię jest wymagane

source: Name may only contain letters
pl: Imię może zawierać tylko litery

source: Name must be at least 5 characters long
pl: Imię musi zawierać co najmniej 5 znaków

source: Name must be at max 50 characters long
pl: Imię musi zawierać najwyżej 50 znaków

source: No user ID token present
pl: Nie znaleziono identyfikatora użytkownika

source: or
pl: lub

source: Password
pl: Hasło

source: Password is required
pl: Hasło jest wymagane

source: Password must be at least 12 characters long
pl: Hasło musi zawierać co najmniej 12 znaków

source: Password must be at max 64 characters long
pl: Hasło musi zawierać najwyżej 64 znaki

source: Password must contain at least 1 lower case letter
pl: Hasło musi zawierać co najmniej 1 małą literę

source: Password must contain at least 1 number
pl: Hasło musi zawierać co najmniej 1 cyfrę

source: Password must contain at least 1 special character
pl: Hasło musi zawierać co najmniej 1 znak specjalny

source: Password must contain at least 1 upper case letter
pl: Hasło musi zawierać co najmniej 1 dużą literę

source: Passwords must match
pl: Hasła muszą być takie same

source: Please enter a valid email address
pl: Proszę podaj poprawny adres email

source: Polish
pl: Polski

source: Resend email
pl: Wyślij email

source: Reset your password
pl: Zresetuj swoje hasło

source: Sent a password reset request!
pl: Wysłano prośbę o zresetowanie hasła!

source: Something went wrong whilst trying to log in via Google
pl: Coś poszło nie tak podczas logowania za pomocą Google

source: Successfully resent the mail!
pl: Wysłano email pomyślnie!

source: This boilerplate includes a simple authentication & authorization with automatic redirects via Supabase and Tanstack Query.
pl: Ten szablon uwzględnia prosty system uwierzytelniania i uprawnienia z automatycznymi przekierowaniami za pomocą Supabase oraz Tanstack Query.

source: Update password
pl: Zaaktualizuj hasło

source: Update your password
pl: Zaaktualizuj swoje hasło

source: We've sent you a password reset link!
pl: Wysłaliśmy ci prośbę o zresetowanie hasła!

source: Welcome back! Please log in to continue
pl: Witamy z powrotem! Proszę zaloguj się aby kontynuować

source: Welcome to Expo!
pl: Witamy w Expo!

source: Welcome! Please fill in the details to get started.
pl: Witamy! Proszę wypełnij informacje aby kontynuować.

source: Your password has been updated!
pl: Twoje hasło zostało zaaktualizowane!
